Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Application setup and configuration
ja_jp: アプリケーションのセットアップと設定

source: Application type
ja_jp: アプリケーションタイプ

source: Application type is changed to `hybrid` because OIDC Dev UI currently supports `SPA` (single-page application) mode only. OIDC Dev UI single-page application, using its own Java Script, authenticates users to the OIDC provider and uses the access token as a Bearer token to access the Quarkus endpoint as a service.
ja_jp: 現在 OIDC Dev UI は、 `SPA` (シングルページアプリケーション) モードのみサポートしています。そのため、アプリケーションタイプは `hybrid` に変更されます。 OIDC Dev UI シングルページアプリケーションは、独自の Java Script を使用して、OIDC プロバイダーに対してユーザーを認証し、アクセストークンをベアラートークンとして使用して、Quarkus エンドポイントにサービスとしてアクセスします。

source: Application type property
ja_jp: アプリケーションタイププロパティー

source: Application-Layer Protocol Negotiation (ALPN) is a TLS extension that allows the client and server to negotiate which protocol they will use for communication during the TLS handshake. ALPN enables more efficient communication by allowing the client to indicate its preferred application protocol to the server before establishing the TLS connection.
ja_jp: Application-Layer Protocol Negotiation (ALPN) は、TLS ハンドシェイク中にクライアントとサーバーが通信に使用するプロトコルをネゴシエートできるようにする TLS エクステンションです。 ALPN は、TLS 接続を確立する前に、クライアントが優先アプリケーションプロトコルをサーバーに指定できるようにすることで、より効率的な通信を可能にします。

source: Applications and components may use any of the following APIs for logging, and the logs will be merged:
ja_jp: アプリケーションやコンポーネントは、以下のいずれかのAPIを使用してログを出力することができ、ログはマージされます。

source: Applications are recommended to use the default, non-strict mode, which makes CDI more convenient to use. The "strictness" of the strict mode (the set of additional validations and the set of disabled improvements on top of the CDI specification) may change over time.
ja_jp: アプリケーションは、CDIをより便利に使えるように、デフォルトの非厳密モードを使用することが推奨されます。厳密モードの「厳密さ」（CDI仕様の上に追加される検証のセットと無効にされる改良のセット）は、将来変化する可能性があります。

source: Applications deployed to Kubernetes won't be accessed via a Kubernetes `Ingress`, but rather as a `NodePort` `Service`. The advantage of doing this is that the URL of an application can be retrieved trivially by executing:
ja_jp: Kubernetesにデプロイされたアプリケーションは、Kubernetesの `Ingress` ではなく、`NodePort` `Service` としてアクセスされます。 この方法の利点は、アプリケーションのURLを実行することで、アプリケーションのURLを簡単に取得できることです。

source: Applications often need to share access to the same cluster. For that purpose, Dev Services for Kubernetes implements a _service discovery_ mechanism for multiple Quarkus applications running in dev mode to share a single cluster.
ja_jp: アプリケーションは、同じクラスターへのアクセスを共有する必要があることがよくあります。その目的のために、Dev Services for Kubernetes は、開発モードで実行されている複数の Quarkus アプリケーションが単一のクラスターを共有するための _サービス検出_ メカニズムを実装しています。

source: Applications send and receive *messages*. A message wraps a _payload_ and can be extended with some _metadata_. With the Kafka connector, a _message_ corresponds to a Kafka _record_.
ja_jp: アプリケーションは *メッセージ* を送受信します。メッセージは _payload_ をラップし、いくつかの _metadata_ で拡張できます。Kafka コネクターを使用すると、_メッセージ_ は Kafka _レコード_ に対応します。

source: Applications send and receive *messages*. https://javadoc.io/doc/io.smallrye.reactive/smallrye-reactive-messaging-api/latest/org/eclipse/microprofile/reactive/messaging/Message.html[`Message`] wraps a _payload_ and can be extended with some _metadata_. This should not be confused with a Pulsar https://javadoc.io/doc/org.apache.pulsar/pulsar-client-api/latest/org/apache/pulsar/client/api/Message.html[`Message`], which consists of value, key With the Pulsar connector, a Reactive Messaging _message_ corresponds to a Pulsar _message_.
ja_jp: アプリケーションは *メッセージ* を送受信します。 https://javadoc.io/doc/io.smallrye.reactive/smallrye-reactive-messaging-api/latest/org/eclipse/microprofile/reactive/messaging/Message.html[`Message`] は、_ペイロード_ をラップし、いくつかの _メタデータ_ で拡張できます。 これは、値とキーで構成される Pulsar https://javadoc.io/doc/org.apache.pulsar/pulsar-client-api/latest/org/apache/pulsar/client/api/Message.html[`Message`] と混同しないでください。 Pulsar コネクターでは、Reactive Messaging _メッセージ_ が Pulsar _メッセージ_ に対応します。

source: Applications should model best practices. Although we want the application to represent a typical usage, someone who copies it shouldn't ever be copying 'wrong' or bad code.
ja_jp: アプリケーションはベストプラクティスをモデル化する必要があります。アプリケーションが典型的な使い方を表すことを望んでいますが、それをコピーする人が「間違った」または悪いコードをコピーするべきではありません。

source: Applications streaming data often need to consume some events from a topic, process them and publish the result to a different topic. A processor method can be simply implemented using both the `@Incoming` and `@Outgoing` annotations:
ja_jp: 多くの場合、データをストリーミングするアプリケーションは、トピックからいくつかのイベントを消費し、それらを処理して、結果を別のトピックに公開する必要があります。プロセッサーメソッドは、 `@Incoming` アノテーションと `@Outgoing` アノテーションの両方を使用して簡単に実装することができます。

source: Applications that are deployed to Kubernetes and need to access the API server will usually make use of the `kubernetes-client` extension:
ja_jp: Kubernetesにデプロイされ、APIサーバにアクセスする必要があるアプリケーションは、通常 `kubernetes-client` エクステンションを利用します。

source: Applications that frequently read the same entities can see their performance improved when the Hibernate ORM second-level cache is enabled.
ja_jp: 同じエンティティを頻繁に読み込むアプリケーションでは、Hibernate ORMのL2キャッシュを有効にするとパフォーマンスが向上します。

source: Applications use datasources to access relational databases. Quarkus provides a unified configuration model to define datasources for Java Database Connectivity (JDBC) and Reactive database drivers.
ja_jp: アプリケーションは、データソースを使用してリレーショナルデータベースにアクセスします。 Quarkusは、Java Database Connectivity（JDBC）およびReactiveデータベースドライバー用のデータソースを定義するための統一された設定モデルを提供します。

source: Applications using a registry client can be configured using environment variables.
ja_jp: レジストリークライアントを使用するアプリケーションは、環境変数を使用して設定できます。

source: Applied AI for Enterprise Java Development image
ja_jp: エンタープライズJava開発のための応用AIの画像

source: Applies the binding information to the workload using volume mounts
ja_jp: ボリュームマウントを使用して、ワークロードにバインド情報を適用する

source: Apply custom named HttpSecurityPolicy to the Jakarta REST `hello` endpoint.
ja_jp: カスタム名の HttpSecurityPolicy を Jakarta REST `hello` エンドポイントに適用します。

source: Apply the `io.quarkus.extension` plugin.
ja_jp: `io.quarkus.extension` プラグインを適用します。

source: Apply the `java-library` plugin for all sub-modules
ja_jp: すべてのサブモジュールに `java-library` プラグインを適用

source: Apply the `maven-publish` plugin used to publish our artifacts
ja_jp: アーティファクトの公開に使用する `maven-publish` プラグインの適用

source: Applying Interceptors to Tests
ja_jp: テストへのインターセプターの適用

source: Applying WebAuthn Authentication In Quarkus
ja_jp: Quarkus での WebAuthn 認証の適用

source: Applying manifests to the cluster
ja_jp: クラスターへのマニフェストの適用

source: Applying the conversion rules for Environment Variables names, `quarkus.datasource."datasource-name".jdbc.url` becomes `QUARKUS_DATASOURCE\__DATASOURCE_NAME__JDBC_URL`. The configuration will work as expected if both properties are available in the Config system.
ja_jp: 環境変数名の変換ルールを適用すると、 `quarkus.datasource."datasource-name".jdbc.url` は `QUARKUS_DATASOURCE__DATASOURCE_NAME__JDBC_URL` になります。 設定システムで両方のプロパティが利用可能であれば、設定は期待通りに動作します。

source: Appropriate for things which affect build and must be visible for run time code. Not read from config at run time.
ja_jp: ビルドに影響し、ランタイムコードで表示される必要があるものに適しています。実行時に設定から読み取られません。

source: Appropriate for things which affect build.
ja_jp: ビルドに影響を与えるものに適しています。

source: ArC comes as a dependency of `quarkus-rest` so you already have it handy.
ja_jp: ArC は `quarkus-rest` の依存関係として提供されているので、既に手元にあります。

source: ArC comes as a dependency of `quarkus-resteasy-reactive` so you already have it handy.
ja_jp: ArCは `quarkus-resteasy` の依存関係として提供されるため、新たに追加する必要はありません。

source: ArC comes as a dependency of `quarkus-resteasy` so you already have it handy.
ja_jp: ArCは `quarkus-resteasy` の依存関係として提供されているので、すでに追加済です。

source: ArC, our CDI implementation, supports CDI decorators.
ja_jp: CDIの実装であるArCは、CDIのデコレーターをサポートします。

source: ArC, the CDI container in Quarkus, is bootstrapped at build time. To integrate with the container, https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#spi_lite[CDI Build Compatible Extensions, window="_blank"] can be used, as well as a Quarkus-specific extension API. CDI Portable Extensions are not and cannot be supported. This guide focuses on the Quarkus-specific extensions API.
ja_jp: QuarkusのCDIコンテナであるArCは、ビルド時にブートストラップされます。 コンテナと統合するには、Quarkus固有のエクステンションAPIだけでなく、 link:https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#spi_lite[CDIビルド互換エクステンション] も使用できます。 CDI Portable Extensionsはサポートされていません。 このガイドでは、Quarkus固有のエクステンションAPIを中心に説明します。

source: ArC, the CDI container in Quarkus, is bootstrapped at build time. To integrate with the container, https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#spi_lite[CDI Build Compatible Extensions, window="_blank"] can be used, as well as a Quarkus-specific extension API. CDI Portable Extensions are not and cannot be supported. This guide focuses on the Quarkus-specific extensions API.
ja_jp: Quarkus の CDI コンテナである ArC は、ビルド時にブートストラップされます。 コンテナと統合するには、Quarkus固有のエクステンションAPIだけでなく、 https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#spi_lite[CDI ビルド五感エクステンション, window="_blank"] も使用できます。 CDI Portable Extensions はサポートされていません。 このガイドでは、Quarkus 固有のエクステンション API を中心に説明します。

source: ArC, the CDI container, is bootstrapped at build time. The downside of this approach is that CDI Portable Extensions cannot be supported. Nevertheless, the functionality can be achieved using the Quarkus-specific extensions API.
ja_jp: CDI コンテナーである ArC はビルド時にブートストラップされます。このアプローチの欠点は、CDI Portable Extensionsをサポートできないことです。それにもかかわらず、Quarkus固有のエクステンションAPIを使用して機能を実現することができます。

source: Arbitrary customizations
ja_jp: 任意のカスタマイズ

source: Arc, the dependency injection framework used by Quarkus, eliminates all the reflection calls and deduces the injection graph at build time. So, when the application starts, no expensive lookups; it’s done already!
ja_jp: Quarkus が使用する依存性注入フレームワークである Arc は、すべてのリフレクション呼び出しを排除し、ビルド時に注入グラフを推論します。したがって、アプリケーションの起動時に高価なルックアップは不要になります。

source: Arc-related transformations should generally be done with link:https://github.com/quarkusio/quarkus/blob/main/extensions/arc/deployment/src/main/java/io/quarkus/arc/deployment/AnnotationsTransformerBuildItem.java[AnnotationsTransformerBuildItem]. The reason is that _all_ Quarkus's bytecode transformations are done after Jandex indexing. This means changes are never reflected back in Jandex.
ja_jp: Arc 関連の変換は、通常、link:https://github.com/quarkusio/quarkus/blob/main/extensions/arc/deployment/src/main/java/io/quarkus/arc/deployment/AnnotationsTransformerBuildItem.java[AnnotationsTransformerBuildItem] を使用して実行する必要があります。 その理由は、Quarkus のすべてのバイトコード変換が Jandex のインデックス作成後に行われるためです。つまり、変更は Jandex に反映されません。

source: Architecting Chain-of-Thought (CoT) solutions for enterprise environments necessitates careful consideration of guardrails and privacy. The following points represent an initial excerpt of critical aspects that software architects must account for to ensure responsible and secure AI deployment. These considerations are vital to manage the transparency of reasoning, maintain answer consistency, and control data exposure within the CoT process.
ja_jp: エンタープライズ環境向けの Chain-of-Thought (CoT) ソリューションを設計するには、ガードレールとプライバシーの慎重な検討が必要です。以下の点は、責任ある安全な AI 展開を確実にするためにソフトウェアアーキテクトが考慮しなければならない重要な側面の一部を示しています。これらの考慮事項は、推論の透明性を管理し、回答の一貫性を維持し、CoT プロセス内でのデータ漏洩を制御するために不可欠です。

source: Architecting secure enterprise AI solutions demands a proactive approach to safeguard sensitive data and preserve organizational integrity. Below are some first thoughts about critical security considerations and architectural patterns you should further investigate when building your solution.
ja_jp: セキュアな企業AIソリューションを設計することは、機密データを保護し、組織の完全性を維持するためにプロアクティブなアプローチを求められます。以下は、ソリューションを構築する際にさらに調査すべき、重要なセキュリティーの考慮事項とアーキテクチャパターンに関する最初の考察です。

source: Architectural considerations drive your decision to use opaque or JSON web token (JWT) token format. Opaque tokens tend to be much shorter than JWT tokens but need most of the token-associated state to be maintained in the provider database. Opaque tokens are effectively database pointers.
ja_jp: トークン形式として、不透明トークンか JSON Web トークン (JWT) のどちらを使用するかは、アーキテクチャーの検討によって決定されます。 不透明トークンは JWT トークンよりもはるかに短い傾向がありますが、トークンに関連する状態のほとんどをプロバイダーのデータベースで維持する必要があります。 不透明トークンは、事実上データベースポインターです。

source: Architectural differences
ja_jp: アーキテクチャの差異

source: Architecture
ja_jp: アーキテクチャ

source: Architecture Overview
ja_jp: アーキテクチャの概要

source: Archived Podcast Videos
ja_jp: ポッドキャストのアーカイブ動画

source: Are there cases an extension isn't necessary?
ja_jp: エクステンションが不要なケースはありますか?

source: Are we visiting a JUG near you? Then look out for their announcements or if not, get them to reach out to us and we’ll see if we can squeeze them in!
ja_jp: あなたの近くのJUGを訪問しますか？もしそうでなければ、私たちに連絡を取って貰ってください。私たちが彼らを押し込めるかどうかを確認します。

source: Are you a developer building microservices? Do you struggle with developing and testing individual microservices that are part of a larger system? Do you want to learn about building REST-based and event-driven applications?
ja_jp: あなたはマイクロサービスを構築する開発者ですか？大きなシステムの一部である個々のマイクロサービスの開発とテストに苦労していますか？RESTベースのアプリケーションやイベントドリブンなアプリケーションの構築について学びたいと思いませんか？

source: Arenas (large size of memory) manage memory allocations efficiently by grouping chunks of memory. So this metric is the number of arenas allocated for a given allocator.
ja_jp: アリーナ (大きなサイズのメモリ) は、メモリチャンクをグループ化することでメモリ割り当てを効率的に管理します。したがって、このメトリクスは、特定のアロケーターに割り当てられたアリーナの数です。

source: Argument files
ja_jp: 引数ファイル

source: Arguments
ja_jp: 引数

source: Arguments of a `@ParameterizedTest` method that are provided by an `ArgumentsProvider`, for example with `@org.junit.jupiter.params.provider.ValueArgumentsProvider`, must be annotated with `@SkipInject`.
ja_jp: `ArgumentsProvider` によって提供される `@ParameterizedTest` メソッドの引数 (たとえば `@org.junit.jupiter.params.provider.ValueArgumentsProvider`) には、 `@SkipInject` アノテーションを付ける必要があります。

source: Arquillian Adaptor
ja_jp: Arquillian アダプター

source: Array Examples
ja_jp: 配列の例

source: Array field values
ja_jp: 配列フィールド値

source: Arrays
ja_jp: 配列

source: Arrays, Lists and Maps of the above
ja_jp: 上記の配列、リスト、マップ

source: Articles on modern UI development with Quarkus before Quinoa
ja_jp: Quinoa以前のQuarkusを使ったモダンUI開発に関する記事

source: Artifact Result build items
ja_jp: アーティファクトリゾルトビルドアイテム

source: Artificial Intelligence is reshaping enterprise software, and Java remains the backbone. Its long-standing reliability, security, and scalability make it ideal for building AI-infused applications.
ja_jp: 人工知能はエンタープライズソフトウェアを再構築しており、Javaはその基盤であり続けています。その長年にわたる信頼性、セキュリティ、スケーラビリティは、AI搭載アプリケーションの構築に最適です。

source: As HTTP messages can have large bodies, we limit the amount of body characters logged. The default limit is `100`, you can change it by specifying `quarkus.rest-client.logging.body-limit`.
ja_jp: HTTP メッセージには大きな本文が含まれる可能性があるため、ログに記録される本文の文字数を制限します。デフォルトの制限は `100` ですが、 `quarkus.rest-client.logging.body-limit` を指定することで変更できます。

source: As Hibernate ORM _classic_ (we also have Hibernate _reactive_) is blocking, you can't use it with RESTEasy _reactive_ without using the `@Blocking` annotation. This annotation changes the dispatching strategy to use a worker thread (instead of the I/O thread).
ja_jp: Hibernate ORM _classic_（Hibernate _reactive_ もあります）はブロッキングなので、 `@Blocking` アノテーションを使用せずにRESTEasy _reactive_で使用することはできません。このアノテーションは、（I/Oスレッドの代わりに）ワーカースレッドを使用するようにディスパッチ戦略を変更します。

source: As MongoDB with Panache allows writing simplified queries, it is sometimes handy to log the generated native queries for debugging purpose.
ja_jp: MongoDB with Panacheではシンプルなクエリを書くことができますが、生成されたネイティブクエリをログに残しておくと、デバッグの際に便利なことがあります。

source: As Project Leyden matures, we will continue to integrate new features into Quarkus. We are looking forward to what Java 27 and beyond will bring.
ja_jp: Project Leyden が成熟するにつれて、私たちは新しい機能を Quarkus に統合し続けます。Java 27 以降がもたらすものに期待しています。

source: As Quarkus 3.31 will provide full support for Java 25, we recommend using it to build your applications and take advantage of these performance improvements.
ja_jp: Quarkus 3.31 は Java 25 の完全なサポートを提供する予定であるため、これらのパフォーマンス向上を活用し、アプリケーションのビルドにこれを使用することをお勧めします。

source: As SSL is de facto the standard nowadays, we decided to enable its support automatically for some of our extensions:
ja_jp: SSLが事実上の標準となっている現在、私たちのエクステンションの一部では自動的にSSLのサポートを有効にすることにしました:

source: As `QuarkusTestResourceLifecycleManager` is not a CDI Bean, classes that implement it can't have fields injected with `@Inject`. You can use `String propertyName = ConfigProvider.getConfig().getValue("quarkus.my-config-group.myconfig", String.class);`
ja_jp: `QuarkusTestResourceLifecycleManager` は CDI Bean ではないため、これを実装するクラスには `@Inject` で注入されたフィールドを含めることはできません。 `String propertyName = ConfigProvider.getConfig().getValue("quarkus.my-config-group.myconfig", String.class);` を使用できます。

source: As a CDI based runtime, Quarkus extensions often make CDI beans available as part of the extension behavior. However, Quarkus DI solution does not support CDI Portable Extensions. Instead, Quarkus extensions can make use of various xref:cdi-reference.adoc[Build Time Extension Points].
ja_jp: CDIベースのランタイムとして、Quarkusのエクステンションは、多くの場合、エクステンションの動作の一部としてCDI Beanを利用できるようにしています。ただし、Quarkus DIソリューションはCDI Portable Extensionsをサポートしていません。代わりに、Quarkusのエクステンションは、さまざまな link:cdi-reference.html[Build Time Extension Point]を利用することができます。

source: As a Quarkus developer, you configure the Quarkus OpenID Connect (OIDC) extension by setting the following properties in the `src/main/resources/application.properties` file.
ja_jp: Quarkus開発者として、Quarkus OpenID Connect（OIDC）エクステンションを設定するには、 `src/main/resources/application.properties` ファイルで以下のプロパティを設定します。

source: As a Quarkus developer, you configure the Quarkus OpenID Connect (OIDC) extension by setting the following properties in the src/main/resources/application.properties file.
ja_jp: Quarkusの開発者は、src/main/resources/application.propertiesファイルに以下のプロパティを設定することで、Quarkus OpenID Connect（OIDC）エクステンションを設定します。

source: As a Spring developer, you might be tempted to add the `@ComponentScan` annotation in order to define specific packages to scan for additional beans. Do note that `@ComponentScan` is entirely unnecessary since Quarkus performs xref:cdi-reference.adoc#bean_discovery[bean discovery] only in `annotated` mode with no visibility boundaries. Moreover, note that the bean discovery in Quarkus happens at build time. In the same vein, Quarkus does not support the Spring `@Import` annotation.
ja_jp: Springの開発者であれば、追加のBeanをスキャンする特定のパッケージを定義するために、 `@ComponentScan` アノテーションを追加したいと思うかもしれません。しかし、Quarkusは可視性の境界がない `annotated` モードでのみ xref:cdi-reference.adoc#bean_discovery[Beanディスカバリー] を行うため、 `@ComponentScan` は全く必要ないことに注意してください。さらに、QuarkusでのBeanディスカバリーはビルド時に行われることに注意してください。同じように、QuarkusはSpringの `@Import` アノテーションをサポートしていません。

source: As a consequence, in case of Maven, for example, the results of `dependency:tree` will not include all the dependencies Quarkus will use to build an application. A similar issue will affect other dependency analysis tools that assume a project adheres to the standard Maven dependency model: they will not be able to capture the effective Quarkus application dependency graph. Unfortunately, that includes the implementation of the https://github.com/CycloneDX/cyclonedx-maven-plugin[CycloneDX Maven plugin].
ja_jp: その結果、たとえば Maven の場合、Quarkus がアプリケーションの構築に使用するすべての依存関係は `dependency:tree` の結果に含まれません。プロジェクトが標準の Maven 依存関係モデルに準拠していると想定する他の依存関係分析ツールも、同様の問題から影響を受け、有効な Quarkus アプリケーション依存関係グラフをキャプチャーできません。残念ながら、これには https://github.com/CycloneDX/cyclonedx-maven-plugin[CycloneDX Maven プラグイン] の実装も含まれます。

source: As a consequence, it’s not possible to change the destination dynamically (using message metadata) when using RabbitMQ.
ja_jp: 結果として、RabbitMQ を使用する場合、(メッセージメタデータを使用して) 宛先を動的に変更することはできません。

source: As a consequence, the result is not the expected one as the first route is called with the path parameter `id` set to `me`. To avoid the conflict, use the `order` attribute:
ja_jp: その結果、パスパラメーター `id` が `me` に設定された状態で最初のルートが呼び出されます。競合を回避するには、 `order` 属性を使用します。

source: As a containerized Java program running in a container defined by the Quarkus build process
ja_jp: Quarkus のビルドプロセスで定義されたコンテナー内で実行されるコンテナー化された Java プログラムとして

source: As a containerized native program running in a container defined by the Quarkus build process
ja_jp: Quarkus のビルドプロセスで定義されたコンテナー内で実行されるコンテナー化されたネイティブプログラムとして

source: As a convention, you should always provide the Quarkus configuration as a yaml file (`base/src/main/resources/application.yml`).
ja_jp: 慣習として、Quarkusの設定は常にyamlファイル( `base/src/main/resources/application.yml`)として提供する必要があります。

source: As a direct consequence of the fact this extension reuses the _main_ HTTP server, all the relevant server configurations apply. See Refer to the xref:http-reference.adoc#ssl[HTTP guide] for more details.
ja_jp: このエクステンションは、_メイン_ の HTTP サーバーを再利用するという事実の直接的な結果として、関連するすべてのサーバー設定が適用されます。詳細は、xref:http-reference.adoc#ssl[HTTP ガイド] を参照してください。

source: As a final step, generate a https://github.com/brendangregg/FlameGraph[flamegraph] with the generated stacks:
ja_jp: 最後に、生成されたスタックを用いて link:https://github.com/brendangregg/FlameGraph[フレームグラフ] を生成します:

source: As a first step, change to the project directory and build the native executable for the application:
ja_jp: 最初のステップとして、プロジェクトディレクトリーに移動し、アプリケーションのネイティブ実行可能ファイルをビルドします。

source: As a jar
ja_jp: jar として

source: As a native executable
ja_jp: ネイティブ実行可能ファイルとして

source: As a plain Java program running in a container defined by Heroku's environment
ja_jp: Heroku の環境で定義されたコンテナー内で動作するプレーンな Java プログラムとして

source: As a reference, these are the full contents of the `pom.xml`:
ja_jp: 参考までに、 `pom.xml` の全内容は以下の通りです。

source: As a result, `OidcWiremockTestResource` recognizes `alice` and `admin` users. The user `alice` has the `user` role only by default - it can be customized with a `quarkus.test.oidc.token.user-roles` system property. The user `admin` has the `user` and `admin` roles by default - it can be customized with a `quarkus.test.oidc.token.admin-roles` system property.
ja_jp: その結果、`OidcWiremockTestResource` は `alice` と `admin` ユーザーを認識します。 ユーザー `alice` にはデフォルトで `user` ロールのみが付与されており、これは `quarkus.test.oidc.token.user-roles` システムプロパティーでカスタマイズできます。 ユーザー `admin` にはデフォルトで `user` と `admin` の両方のロールが付与されており、これは `quarkus.test.oidc.token.admin-roles` システムプロパティーでカスタマイズできます。

source: As a result, applications that use the TLS Registry can be ready to handle secure communications out of the box.
ja_jp: そのため、TLS レジストリーを使用するアプリケーションは、すぐにセキュアな通信を処理できるようになります。

source: As a result, certain classes, such as `HttpServletRequest` are not always available for injection. Most use cases for this particular class are covered by Jakarta REST equivalents, except for getting the remote client's IP.
ja_jp: そのため、`HttpServletRequest` などの特定のクラスは常に注入できるとは限りません。 このような特定のクラスのユースケースは、リモートクライアントの IP を取得する場合を除き、Jakarta REST の同等の機能でほとんどカバーされています。
